You will need to download the credentials file from google cloud console once you generate keys. 

Setting Up credentials.json
Step 3: Generate a JSON Key

    Navigate to the Service Account Section:
        In the Google Cloud Console, go to APIs & Services > Credentials.
        Locate the service account you created.

    Attempt to Add a Key:
        Click on the three dots next to the service account and select Manage Keys.
        If the "Add Key" option is unavailable or grayed out, this is likely due to the iam.disableServiceAccountKeyCreation policy being enabled in your organization.

Resolving iam.disableServiceAccountKeyCreation Policy Issue

In some organizations, the ability to generate service account keys is restricted by the iam.disableServiceAccountKeyCreation policy. This restriction is often in place for security reasons, but it can be temporarily lifted to generate a key. Here’s how to address it:
Step 1: Identify the Policy Restriction

    Navigate to the IAM Policies in the Google Cloud Console.
    Search for the iam.disableServiceAccountKeyCreation policy.
    Confirm that this policy is enabled for your project or organization.

Step 2: Contact Your Organization Admin

If you don't have permissions to modify policies, contact your organization's admin and request the following:

    Temporarily disable the iam.disableServiceAccountKeyCreation policy for the project where the service account resides.
    Alternatively, request that the admin generate the service account key on your behalf.

Step 3: Temporarily Modify the Policy (If You Have Permissions)

If you have sufficient permissions, you can modify the policy yourself:

    Navigate to IAM Settings:
        Go to IAM & Admin > Policies in the Google Cloud Console.

    Locate the Policy:
        Search for the iam.disableServiceAccountKeyCreation entry.

    Edit the Policy:
        Click Edit Policy and change the setting to Disabled for the duration of the setup process.
        Save the changes.

    Generate the Key:
        Return to the service account, navigate to Manage Keys, and click Add Key > Create New Key (JSON).

    Re-enable the Policy:
        Once the key is created, return to the IAM policy and re-enable iam.disableServiceAccountKeyCreation to restore the security policy.

Common Issues and Solutions
Issue: Unable to Disable iam.disableServiceAccountKeyCreation

    Problem: Even with permissions, organizational policies might prevent modification of this setting.
    Solution:
        Check with your admin whether exceptions can be added for specific service accounts.
        Alternatively, request that the admin generate the key and share it securely.

Best Practices After Resolving

    Secure the Key: Ensure the credentials.json file is stored securely, as it contains sensitive authentication data.
    Restrict Access: Limit access to the Google Sheet and service account to trusted users only.
    Audit Usage: Regularly review the usage of the service account and remove unnecessary keys if they are no longer needed.

Why This Matters

We ran into this exact issue during setup, and addressing it required temporarily relaxing organizational restrictions. Including this in your README.md or documentation ensures others are aware of potential challenges and can address them efficiently.
